def decode_numbers(numbers: str) -> str | None:

    mapping = {
        "0": " ",
        "1": ".",
        "2": "а",
        "3": "д",
        "4": "и",
        "5": "м",
        "6": "р",
        "7": "ф",
        "8": "ш",
        "9": "ь",
        "11": ",",
        "22": "б",
        "33": "е",
        "44": "й",
        "55": "н",
        "66": "с",
        "77": "х",
        "88": "щ",
        "99": "э",
        "111": "?",
        "222": "в",
        "333": "ж",
        "444": "к",
        "555": "о",
        "666": "т",
        "777": "ц",
        "888": "ъ",
        "999": "ю",
        "1111": "!",
        "2222": "г",
        "3333": "з",
        "4444": "л",
        "5555": "п",
        "6666": "у",
        "7777": "ч",
        "8888": "ы",
        "9999": "я",
        "11111": ":",
        "111111": ";"
    }

    numbers = numbers.split(" ")
    result = ""

    for number in numbers:
        if number in mapping:
            result += mapping[number]
        else:
            return None

    return result if result else None